[
  {
    "id": "play-tennis-everywhere",
    "title": "Play Tennis Everywhere",
    "shortDescription": "AI-powered tennis partner matching platform connecting players based on availability, location, and skill level.",
    "detailedDescription": "Play Tennis Everywhere is a social tennis platform that revolutionizes how tennis players find partners. As CTO and co-founder, I led the technical development of this comprehensive matching system that uses AI algorithms to connect players based on multiple criteria including skill level, location, availability, and preferences.\n\nThe platform addresses a common frustration in the tennis community: the difficulty of finding compatible partners, especially when traveling. Our intelligent matching system analyzes user criteria to propose the most compatible partners, making tennis accessible anywhere.\n\nKey features include AI-powered partner matching based on skill level and location, availability-based scheduling with calendar integration, profile browsing with detailed player information, integrated messaging system for coordination, travel mode for finding partners while on vacation, and personalized recommendations for skill progression. The waitlist launched in June 2025 with exclusive benefits for early adopters including beta access, extended free access, and influence on feature development.",
    "image": "/images/projects/play-tennis-everywhere.png",
    "imageAlt": "Play Tennis Everywhere interface showing partner matching and scheduling features",
    "technologies": ["Next.js", "TypeScript", "Supabase", "Tailwind CSS", "Resend", "AI Matching Algorithm"],
    "githubUrl": null,
    "liveUrl": "https://play-tennis-everywhere.com",
    "featured": true,
    "order": 1,
    "createdAt": "2025-06-01T00:00:00Z",
    "updatedAt": "2025-10-04T00:00:00Z"
  },
  {
    "id": "fall-corp",
    "title": "Fall Corp",
    "shortDescription": "A comprehensive platform connecting startups with investors and helping founders build complete teams through talent matching.",
    "detailedDescription": "VentureNexus (initially called Fall Corp) was developed during an innovation program study exchange in Shanghai in June 2025. This project was built using agile methodology in a team environment, addressing two major challenges in the entrepreneurial ecosystem: connecting startups with suitable investors and helping founders build complete teams.\n\nThe platform serves three user types: founders looking to build teams and secure funding, professionals (designers, developers, marketers) seeking startup opportunities, and investors searching for qualified deals. It features an advanced matching algorithm that connects founders with professionals based on required skills and investors with startups based on investment criteria.\n\nKey features include detailed startup profiles with pitch decks and metrics, talent marketplace with skill-based filtering, secure encrypted messaging system, project categorization by sector and development stage, investor verification and accreditation system, document sharing capabilities, and comprehensive search filters for all user types. The platform uses a sophisticated matching algorithm to suggest optimal connections between all parties, creating a complete ecosystem for startup success. Note: The live version is no longer functional due to resource costs.",
    "image": "/images/projects/fall-corp.png",
    "imageAlt": "VentureNexus platform showing startup matching and team building interface",
    "technologies": ["TypeScript", "Supabase", "Tailwind CSS", "Lovable Platform"],
    "githubUrl": "https://github.com/Amorizz/fall_corp/",
    "liveUrl": "https://fall-corp.lovable.app/",
    "featured": true,
    "order": 2,
    "createdAt": "2025-06-01T00:00:00Z",
    "updatedAt": "2025-06-30T00:00:00Z"
  },
  {
    "id": "pocket-imperium",
    "title": "Pocket Imperium",
    "shortDescription": "A Java implementation of the strategic space conquest board game with both GUI and console interfaces.",
    "detailedDescription": "Pocket Imperium is a digital adaptation of the acclaimed strategic board game where 2-4 players compete for galactic dominance. This Java implementation features both a graphical user interface and console-based gameplay, making it accessible for different play styles.\n\nThe game is a quick-playing 4X space game (eXplore, eXpand, eXploit, eXterminate) where players simultaneously choose commands to move their fleets, expand their empires, and develop their systems. The digital version faithfully recreates the strategic depth of the original board game, including its unique command selection mechanic where players must anticipate their opponents' actions.\n\nKey features include dual interface support (GUI and console), turn-based strategic gameplay with simultaneous command selection, fleet movement and combat system, territory expansion and control mechanics, victory point tracking, and multi-player support for 2-4 players. The game emphasizes quick decision-making and strategic planning, with games typically lasting 30-45 minutes. Built entirely in Java, it demonstrates object-oriented programming principles, game state management, and user interface design.",
    "image": "/images/projects/pocket-imperium.png",
    "imageAlt": "Pocket Imperium game interface showing space conquest gameplay",
    "technologies": ["Java", "Swing/AWT", "Console I/O", "Object-Oriented Design"],
    "githubUrl": "https://github.com/Amorizz/pocket-imperium/",
    "liveUrl": null,
    "featured": false,
    "order": 3,
    "createdAt": "2024-04-01T00:00:00Z",
    "updatedAt": "2024-06-30T00:00:00Z"
  },
  {
    "id": "portfolio-website",
    "title": "Portfolio Website",
    "shortDescription": "A modern, open-source portfolio template built with Next.js, featuring smooth animations, dark theme, and optimized performance.",
    "detailedDescription": "This portfolio website serves as both a personal showcase and an open-source template for others to use. Built with Next.js 15, TypeScript, and modern web technologies, it demonstrates current best practices in web development with a focus on performance, accessibility, and user experience.\n\nThe website features a sophisticated dark theme with smooth animations powered by modern CSS and JavaScript. It's designed to be easily customizable, allowing others to fork the repository and adapt it for their own use. The project showcases advanced Next.js features including the App Router, Server Components, and built-in Image optimization.\n\nKey features include fully responsive design optimized for all devices, elegant dark theme with carefully chosen color palette, smooth scroll animations and transitions, project showcase with detailed descriptions, SEO optimization with proper meta tags and structured data, performance optimization with Next.js best practices, accessibility compliance following WCAG guidelines, and modern UI components using shadcn/ui. The codebase is well-documented and structured to serve as a learning resource for other developers. Available as open-source for anyone to use and customize for their own portfolio needs.",
    "image": "/images/projects/portfolio-website.png",
    "imageAlt": "Modern portfolio website showcasing projects with dark theme design",
    "technologies": ["Next.js", "TypeScript", "Tailwind CSS", "shadcn/ui", "Vercel"],
    "githubUrl": "https://github.com/Amorizz/portfolio",
    "liveUrl": "https://amaury-dufrenot.com",
    "featured": true,
    "order": 4,
    "createdAt": "2025-10-01T00:00:00Z",
    "updatedAt": "2025-10-04T00:00:00Z"
  }
]