[
  {
    "id": "ecommerce-platform",
    "title": "E-Commerce Platform",
    "shortDescription": "A full-stack e-commerce solution with modern UI, payment processing, and admin dashboard built with Next.js and TypeScript.",
    "detailedDescription": "This comprehensive e-commerce platform was built from the ground up using Next.js 15, TypeScript, and Tailwind CSS. The application features a modern, responsive design with a complete shopping experience including product catalog, user authentication, shopping cart, and secure payment processing via Stripe.\n\nThe platform includes an advanced admin dashboard for inventory management, order tracking, and customer analytics. Built with performance in mind, it achieves excellent Lighthouse scores and provides a seamless user experience across all devices.\n\nKey features include real-time inventory updates, advanced search and filtering, user reviews and ratings, order tracking, and comprehensive analytics dashboard for business insights.",
    "image": "/images/placeholder-project.svg",
    "imageAlt": "E-commerce platform screenshot showing modern shopping interface",
    "technologies": ["Next.js", "TypeScript", "Tailwind CSS", "Stripe", "PostgreSQL", "Prisma", "NextAuth.js", "Vercel"],
    "githubUrl": "https://github.com/amaud/ecommerce-platform",
    "liveUrl": "https://ecommerce-demo.amaud.dev",
    "featured": true,
    "order": 1,
    "createdAt": "2024-01-15T00:00:00Z",
    "updatedAt": "2024-02-20T00:00:00Z"
  },
  {
    "id": "task-management-app",
    "title": "Task Management App",
    "shortDescription": "A collaborative task management application with real-time updates, drag-and-drop functionality, and team collaboration features.",
    "detailedDescription": "Built with React, Node.js, and Socket.io, this task management application provides a comprehensive solution for team collaboration. The app features real-time updates, drag-and-drop task organization, file attachments, and advanced filtering options.\n\nThe application includes user authentication, role-based permissions, project organization, and detailed analytics. The modern UI is built with Material-UI components and provides an intuitive user experience.\n\nKey features include real-time collaboration, drag-and-drop task boards, file sharing, team chat, deadline tracking, and comprehensive reporting dashboard.",
    "image": "/images/placeholder-project.svg",
    "imageAlt": "Task management application interface with drag-and-drop functionality",
    "technologies": ["React", "Node.js", "Socket.io", "MongoDB", "Material-UI", "Express", "JWT", "AWS S3"],
    "githubUrl": "https://github.com/amaud/task-management-app",
    "liveUrl": "https://tasks.amaud.dev",
    "featured": true,
    "order": 2,
    "createdAt": "2024-02-10T00:00:00Z",
    "updatedAt": "2024-03-15T00:00:00Z"
  },
  {
    "id": "portfolio-website",
    "title": "Portfolio Website",
    "shortDescription": "A modern, responsive portfolio website built with Next.js, featuring dark theme, smooth animations, and optimized performance.",
    "detailedDescription": "This portfolio website showcases modern web development practices with a focus on performance, accessibility, and user experience. Built with Next.js 15, TypeScript, and Tailwind CSS, it features a sophisticated dark theme inspired by GitHub's design system.\n\nThe website includes smooth animations, responsive design, SEO optimization, and performance optimization techniques. It demonstrates advanced Next.js features including App Router, Server Components, and Image optimization.\n\nKey features include responsive design, dark theme, smooth animations, SEO optimization, performance optimization, accessibility compliance, and modern UI components.",
    "image": "/images/placeholder-project.svg",
    "imageAlt": "Portfolio website homepage showing modern dark theme design",
    "technologies": ["Next.js", "TypeScript", "Tailwind CSS", "Framer Motion", "Vercel", "shadcn/ui"],
    "githubUrl": "https://github.com/amaud/portfolio-website",
    "liveUrl": "https://amaud.dev",
    "featured": true,
    "order": 3,
    "createdAt": "2024-03-01T00:00:00Z",
    "updatedAt": "2024-03-25T00:00:00Z"
  },
  {
    "id": "weather-dashboard",
    "title": "Weather Dashboard",
    "shortDescription": "A comprehensive weather dashboard with real-time data, forecasts, and interactive maps built with React and weather APIs.",
    "detailedDescription": "This weather dashboard provides comprehensive weather information with real-time updates, 7-day forecasts, and interactive maps. Built with React and integrated with multiple weather APIs for accurate data.\n\nThe application features location-based weather, detailed forecasts, weather alerts, and historical data visualization. The responsive design works seamlessly across all devices.\n\nKey features include real-time weather updates, location-based forecasts, interactive weather maps, weather alerts, historical data, and responsive design.",
    "image": "/images/placeholder-project.svg",
    "imageAlt": "Weather dashboard showing current conditions and forecast",
    "technologies": ["React", "JavaScript", "OpenWeather API", "Chart.js", "Leaflet", "CSS3", "Netlify"],
    "githubUrl": "https://github.com/amaud/weather-dashboard",
    "liveUrl": "https://weather.amaud.dev",
    "featured": false,
    "order": 4,
    "createdAt": "2023-12-15T00:00:00Z",
    "updatedAt": "2024-01-10T00:00:00Z"
  },
  {
    "id": "blog-cms",
    "title": "Blog CMS",
    "shortDescription": "A headless CMS for blogging with markdown support, SEO optimization, and content management features.",
    "detailedDescription": "This headless CMS provides a complete blogging solution with markdown support, SEO optimization, and content management features. Built with Next.js and integrated with a headless CMS for content management.\n\nThe system includes markdown editing, image optimization, SEO tools, content scheduling, and analytics. The frontend is built with Next.js for optimal performance and SEO.\n\nKey features include markdown support, SEO optimization, content scheduling, image optimization, analytics integration, and responsive design.",
    "image": "/images/placeholder-project.svg",
    "imageAlt": "Blog CMS interface showing content management features",
    "technologies": ["Next.js", "Markdown", "MDX", "Contentful", "Vercel", "SEO Tools"],
    "githubUrl": "https://github.com/amaud/blog-cms",
    "liveUrl": "https://blog.amaud.dev",
    "featured": false,
    "order": 5,
    "createdAt": "2023-11-20T00:00:00Z",
    "updatedAt": "2024-01-05T00:00:00Z"
  },
  {
    "id": "api-gateway",
    "title": "API Gateway",
    "shortDescription": "A microservices API gateway with authentication, rate limiting, and request routing built with Node.js and Express.",
    "detailedDescription": "This API gateway provides a centralized entry point for microservices with authentication, rate limiting, and request routing. Built with Node.js and Express, it handles thousands of requests per second.\n\nThe gateway includes JWT authentication, rate limiting, request logging, error handling, and service discovery. It's designed for high availability and scalability.\n\nKey features include JWT authentication, rate limiting, request routing, service discovery, logging, monitoring, and high availability.",
    "image": "/images/placeholder-project.svg",
    "imageAlt": "API Gateway architecture diagram showing microservices integration",
    "technologies": ["Node.js", "Express", "JWT", "Redis", "Docker", "Kubernetes", "Prometheus"],
    "githubUrl": "https://github.com/amaud/api-gateway",
    "liveUrl": null,
    "featured": false,
    "order": 6,
    "createdAt": "2023-10-10T00:00:00Z",
    "updatedAt": "2023-12-01T00:00:00Z"
  }
]
