[
  {
    "id": "novad",
    "title": "Novad",
    "shortDescription": "Plateforme de matching émotionnel de villes pour les digital nomads — trouvez votre prochaine destination selon ce que vous voulez ressentir, pas juste le coût et le wifi.",
    "detailedDescription": "Novad est une plateforme de matching émotionnel qui réinvente la façon dont les digital nomads choisissent leur prochaine destination. Au lieu de filtrer les villes par coût de la vie et vitesse internet, Novad fait correspondre les utilisateurs selon ce qu'ils veulent ressentir — calme, aventure, créativité, connexion.\n\nEn tant que fondateur, j'ai construit l'intégralité du produit du concept au lancement. L'algorithme de matching traduit les émotions en attributs de ville mesurables et évalue plus de 300 destinations dans le monde en utilisant des données réelles et des témoignages de nomads. Les utilisateurs répondent à un quiz de 60 secondes et reçoivent des recommandations personnalisées classées par affinité émotionnelle.\n\nLa plateforme inclut des guides complets pour plus de 300 destinations avec des sections détaillées sur les quartiers, la vie de digital nomad, la culture et l'ambiance, les points forts et les conseils pratiques. Chaque guide est rédigé du point de vue d'un travailleur à distance avec des données structurées pour les métriques clés comme le loyer mensuel, la vitesse internet, le score nomad et la sécurité.\n\nFonctionnalités supplémentaires : classements basés sur les données (villes les moins chères, internet le plus rapide, meilleure communauté), répertoires par pays, un blog sur la planification de voyages émotionnels et la récupération du burnout nomade, et des pages de comparaison avec des concurrents comme Nomad List. Construit avec un focus sur le SEO et la qualité du contenu, Novad se positionne comme l'alternative « feeling-first » aux outils nomades basés sur des tableurs.",
    "image": "/images/projects/novad.png",
    "imageAlt": "Plateforme Novad montrant le matching émotionnel de villes pour digital nomads",
    "technologies": ["Next.js", "TypeScript", "Tailwind CSS", "AI Matching", "SEO", "Vercel"],
    "githubUrl": null,
    "liveUrl": "https://novad.app",
    "featured": true,
    "order": 0,
    "createdAt": "2025-01-01T00:00:00Z",
    "updatedAt": "2026-02-23T00:00:00Z"
  },
  {
    "id": "play-tennis-everywhere",
    "title": "Play Tennis Everywhere",
    "shortDescription": "Plateforme de mise en relation de partenaires de tennis propulsée par l'IA, connectant les joueurs selon leur disponibilité, localisation et niveau.",
    "detailedDescription": "Play Tennis Everywhere est une plateforme sociale de tennis qui révolutionne la manière dont les joueurs de tennis trouvent des partenaires. En tant que CTO et co-fondateur, j'ai dirigé le développement technique de ce système complet de mise en relation qui utilise des algorithmes d'IA pour connecter les joueurs selon plusieurs critères incluant le niveau, la localisation, la disponibilité et les préférences.\n\nLa plateforme répond à une frustration courante dans la communauté du tennis : la difficulté de trouver des partenaires compatibles, surtout en voyage. Notre système de mise en relation intelligent analyse les critères des utilisateurs pour proposer les partenaires les plus compatibles, rendant le tennis accessible partout.\n\nFonctionnalités clés : mise en relation IA basée sur le niveau et la localisation, planification selon les disponibilités avec intégration calendrier, navigation des profils avec informations détaillées des joueurs, système de messagerie intégré pour la coordination, mode voyage pour trouver des partenaires en vacances, et recommandations personnalisées pour la progression du niveau. La liste d'attente a été lancée en août 2025 avec des avantages exclusifs pour les premiers adoptants incluant l'accès bêta, un accès gratuit étendu et une influence sur le développement des fonctionnalités.",
    "image": "/images/projects/play-tennis-everywhere.png",
    "imageAlt": "Interface de Play Tennis Everywhere montrant la mise en relation de partenaires et les fonctionnalités de planification",
    "technologies": ["Next.js", "TypeScript", "Supabase", "Tailwind CSS", "Resend", "Algorithme de Matching IA"],
    "githubUrl": null,
    "liveUrl": "https://play-tennis-everywhere.com",
    "featured": false,
    "order": 3,
    "createdAt": "2025-08-01T00:00:00Z",
    "updatedAt": "2025-10-04T00:00:00Z"
  },
  {
    "id": "fall-corp",
    "title": "Fall Corp",
    "shortDescription": "Plateforme complète connectant les startups aux investisseurs et aidant les fondateurs à constituer des équipes via la mise en relation de talents.",
    "detailedDescription": "VentureNexus (initialement appelé Fall Corp) a été développé pendant un programme d'innovation d'échange à Shanghai à partir d'avril 2025. Ce projet a été construit en utilisant la méthodologie agile en équipe, abordant deux défis majeurs dans l'écosystème entrepreneurial : connecter les startups avec les investisseurs appropriés et aider les fondateurs à constituer des équipes complètes.\n\nLa plateforme sert trois types d'utilisateurs : les fondateurs cherchant à constituer des équipes et obtenir du financement, les professionnels (designers, développeurs, marketers) cherchant des opportunités dans les startups, et les investisseurs recherchant des deals qualifiés. Elle propose un algorithme de mise en relation avancé qui connecte les fondateurs avec les professionnels selon les compétences requises et les investisseurs avec les startups selon les critères d'investissement.\n\nFonctionnalités clés : profils détaillés de startup avec pitch decks et métriques, marketplace de talents avec filtrage par compétences, système de messagerie sécurisée et cryptée, catégorisation des projets par secteur et stade de développement, système de vérification et d'accréditation des investisseurs, capacités de partage de documents, et filtres de recherche complets pour tous les types d'utilisateurs. La plateforme utilise un algorithme de mise en relation sophistiqué pour suggérer des connexions optimales entre toutes les parties, créant un écosystème complet pour le succès des startups. Note : La version en ligne n'est plus fonctionnelle en raison des coûts de ressources.",
    "image": "/images/projects/fall-corp.png",
    "imageAlt": "Plateforme VentureNexus montrant la mise en relation de startups et la constitution d'équipes",
    "technologies": ["TypeScript", "Supabase", "Tailwind CSS", "Lovable Platform"],
    "githubUrl": "https://github.com/Amorizz/fall_corp/",
    "liveUrl": "https://fall-corp.lovable.app/",
    "featured": false,
    "order": 4,
    "createdAt": "2025-04-01T00:00:00Z",
    "updatedAt": "2025-06-30T00:00:00Z"
  },
  {
    "id": "archive-server",
    "title": "Archive Server & Virtual Shell",
    "shortDescription": "Un serveur d'archives et un shell virtuel client en Bash, permettant l'archivage distant, l'extraction et la navigation interactive via netcat.",
    "detailedDescription": "ArchiveServer est un projet de programmation système entièrement construit en Bash qui implémente une architecture client-serveur pour la gestion d'archives de fichiers personnalisées sur le réseau.\n\nLe serveur écoute sur un port configurable via netcat et gère trois commandes principales : LIST (parcourir les archives disponibles), GET (télécharger une archive) et PUT (uploader une archive). Il stocke les archives dans un répertoire local et journalise toutes les opérations.\n\nLe shell virtuel (vsh) est l'outil côté client qui communique avec le serveur. Il supporte quatre modes :\n- Create : Parcourt récursivement le répertoire courant, construit un format d'archive personnalisé avec un en-tête (métadonnées : chemins, permissions, tailles, offsets) et un corps (contenus des fichiers), puis l'uploade sur le serveur.\n- Extract : Télécharge une archive et reconstruit la structure complète des répertoires localement, en restaurant les permissions.\n- List : Interroge le serveur pour lister toutes les archives disponibles.\n- Browse : Le mode le plus avancé — un shell virtuel interactif qui permet de naviguer dans une archive comme s'il s'agissait d'un système de fichiers réel. Supporte ls (avec drapeaux -a, -l), cd (chemins absolus/relatifs et ..), cat, mkdir (-p pour les imbriqués), touch et rm (récursif pour les répertoires).\n\nLe mode browse fonctionne en analysant l'en-tête de l'archive pour maintenir un pointeur de répertoire virtuel courant, permettant une navigation complète sans extraction. Le format d'archive utilise une structure personnalisée avec des offsets basés sur les lignes pour un accès aléatoire efficace au contenu des fichiers.",
    "image": null,
    "imageAlt": "Interface terminal Archive Server et Virtual Shell",
    "technologies": ["Bash", "Netcat", "Linux", "Shell Scripting", "Client-Server"],
    "githubUrl": "https://github.com/Amorizz/ArchiveServer",
    "liveUrl": null,
    "featured": true,
    "order": 1,
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-06-01T00:00:00Z"
  },
  {
    "id": "pocket-imperium",
    "title": "Pocket Imperium",
    "shortDescription": "Implémentation Java du jeu de plateau stratégique de conquête spatiale avec interfaces GUI et console.",
    "detailedDescription": "Pocket Imperium est une adaptation numérique du jeu de plateau stratégique acclamé où 2 à 4 joueurs se disputent la domination galactique. Cette implémentation Java propose à la fois une interface graphique et un mode de jeu en console, rendant le jeu accessible à différents styles de jeu.\n\nLe jeu est un jeu spatial 4X rapide (eXplorer, eXpansion, eXploiter, eXterminer) où les joueurs choisissent simultanément des commandes pour déplacer leurs flottes, étendre leurs empires et développer leurs systèmes. La version numérique recrée fidèlement la profondeur stratégique du jeu de plateau original, incluant son mécanisme unique de sélection de commandes où les joueurs doivent anticiper les actions de leurs adversaires.\n\nFonctionnalités clés : support double interface (GUI et console), gameplay stratégique au tour par tour avec sélection simultanée de commandes, système de déplacement de flotte et de combat, mécaniques d'expansion et de contrôle de territoire, suivi des points de victoire, et support multijoueur pour 2 à 4 joueurs. Le jeu met l'accent sur la prise de décision rapide et la planification stratégique, avec des parties durant généralement 30 à 45 minutes. Entièrement construit en Java, il démontre les principes de programmation orientée objet, la gestion d'état de jeu et la conception d'interface utilisateur.",
    "image": "/images/projects/pocket-imperium.png",
    "imageAlt": "Interface du jeu Pocket Imperium montrant le gameplay de conquête spatiale",
    "technologies": ["Java", "Swing/AWT", "Console I/O", "Conception Orientée Objet"],
    "githubUrl": "https://github.com/Amorizz/pocket-imperium/",
    "liveUrl": null,
    "featured": false,
    "order": 7,
    "createdAt": "2024-04-01T00:00:00Z",
    "updatedAt": "2024-06-30T00:00:00Z"
  },
  {
    "id": "tiny-habits",
    "title": "Tiny Habits",
    "shortDescription": "Un tracker de finances visuel et mobile-first pour étudiants, avec un tableau de bord personnalisable en drag-and-drop, suivi de budget et objectifs d'épargne.",
    "detailedDescription": "Tiny Habits est une application de suivi financier conçue spécifiquement pour les étudiants qui veulent développer de meilleures habitudes de dépenses. Construite pendant notre semestre d'échange à l'Université de Shanghai (Printemps 2025) dans le cadre du programme Innovation Period, elle a remporté les prix de Best Public Speaking et Outstanding Business Potential.\n\nL'application propose un tableau de bord entièrement personnalisable en drag-and-drop où les utilisateurs peuvent arranger, redimensionner et activer/désactiver des widgets : aperçu du solde, graphiques de dépenses, répartition par catégories, objectifs d'épargne, compteur de cafés et tracker de bonnes décisions financières.\n\nFonctionnalités clés : gestion des transactions avec suivi revenus/dépenses, classification besoin vs envie, et recherche/filtrage. Suivi de budget avec limites mensuelles par catégorie et barres de progression visuelles. Objectifs d'épargne avec montants cibles, échéances et visualisation de la progression. Catégorisation automatique des transactions par IA via l'API OpenAI.\n\nLe tableau de bord utilise @hello-pangea/dnd pour le réordonnancement drag-and-drop fluide, Recharts pour la visualisation des données, et shadcn/ui pour une interface moderne et épurée. L'app gamifie les habitudes financières avec des défis, des conseils et un suivi de séries pour maintenir l'engagement des étudiants.",
    "image": null,
    "imageAlt": "Tableau de bord du tracker financier Tiny Habits",
    "technologies": ["Next.js", "TypeScript", "Tailwind CSS", "shadcn/ui", "Recharts", "OpenAI API"],
    "githubUrl": "https://github.com/Amorizz/tiny-habits",
    "liveUrl": null,
    "featured": false,
    "order": 6,
    "createdAt": "2025-04-01T00:00:00Z",
    "updatedAt": "2025-06-01T00:00:00Z"
  },
  {
    "id": "translate-project",
    "title": "Translate Project",
    "shortDescription": "Pipeline de transcription vidéo et traduction de sous-titres par IA — transcription vocale, amélioration des sous-titres, et traduction anglais vers français.",
    "detailedDescription": "Translate Project est un pipeline full-stack qui convertit des fichiers vidéo en sous-titres traduits. Il combine reconnaissance vocale, post-traitement de sous-titres et traduction automatique en un seul workflow.\n\nLe backend utilise FastAPI pour exposer deux endpoints : /transcribe (propulsé par faster-whisper pour la conversion parole-texte) et /translate_srt (utilisant le modèle multilingue M2M100 de Meta pour la traduction EN→FR). Un frontend Streamlit fournit une interface intuitive pour uploader des vidéos, prévisualiser les transcriptions et télécharger les fichiers SRT traduits.\n\nLe module translator inclut un splitter de sous-titres pour nettoyer et restructurer les segments SRT bruts, et un enhancer IA qui utilise un modèle Mistral 7B local (via llama.cpp) pour affiner la formulation des sous-titres pour une lisibilité naturelle.\n\nConstruit comme projet universitaire à l'UTT avec une équipe de trois, combinant NLP, inférence LLM locale et développement web full-stack.",
    "image": null,
    "imageAlt": "Interface de traduction de sous-titres Translate Project",
    "technologies": ["Python", "FastAPI", "Streamlit", "Whisper", "M2M100", "Mistral 7B", "llama.cpp", "PyTorch"],
    "githubUrl": "https://github.com/Amorizz/translate-project",
    "liveUrl": null,
    "featured": true,
    "order": 2,
    "createdAt": "2025-01-01T00:00:00Z",
    "updatedAt": "2025-03-01T00:00:00Z"
  },
  {
    "id": "portfolio-website",
    "title": "Site Portfolio",
    "shortDescription": "Template de portfolio moderne et open-source construit avec Next.js, proposant animations fluides, thème sombre et performances optimisées.",
    "detailedDescription": "Ce site portfolio sert à la fois de vitrine personnelle et de template open-source pour les autres. Construit avec Next.js 15, TypeScript et technologies web modernes, il démontre les meilleures pratiques actuelles en développement web avec un focus sur la performance, l'accessibilité et l'expérience utilisateur.\n\nLe site propose un thème sombre sophistiqué avec des animations fluides propulsées par CSS et JavaScript modernes. Il est conçu pour être facilement personnalisable, permettant aux autres de forker le dépôt et de l'adapter à leur usage personnel. Le projet met en valeur les fonctionnalités avancées de Next.js incluant l'App Router, les Server Components et l'optimisation d'images intégrée.\n\nFonctionnalités clés : design entièrement responsive optimisé pour tous les appareils, thème sombre élégant avec palette de couleurs soigneusement choisie, animations et transitions de défilement fluides, vitrine de projets avec descriptions détaillées, optimisation SEO avec meta tags appropriés et données structurées, optimisation des performances avec les meilleures pratiques Next.js, conformité d'accessibilité suivant les directives WCAG, et composants UI modernes utilisant shadcn/ui. La base de code est bien documentée et structurée pour servir de ressource d'apprentissage pour les autres développeurs. Disponible en open-source pour que quiconque puisse l'utiliser et le personnaliser pour son propre portfolio.",
    "image": "/images/projects/portfolio-website.png",
    "imageAlt": "Site portfolio moderne présentant des projets avec un design à thème sombre",
    "technologies": ["Next.js", "TypeScript", "Tailwind CSS", "shadcn/ui", "Vercel"],
    "githubUrl": "https://github.com/Amorizz/portfolio",
    "liveUrl": "https://amaury-dufrenot.com",
    "featured": false,
    "order": 5,
    "createdAt": "2025-10-01T00:00:00Z",
    "updatedAt": "2025-10-04T00:00:00Z"
  }
]
