[
  {
    "id": "play-tennis-everywhere",
    "title": "Play Tennis Everywhere",
    "shortDescription": "Plateforme de mise en relation de partenaires de tennis propulsée par l'IA, connectant les joueurs selon leur disponibilité, localisation et niveau.",
    "detailedDescription": "Play Tennis Everywhere est une plateforme sociale de tennis qui révolutionne la manière dont les joueurs de tennis trouvent des partenaires. En tant que CTO et co-fondateur, j'ai dirigé le développement technique de ce système complet de mise en relation qui utilise des algorithmes d'IA pour connecter les joueurs selon plusieurs critères incluant le niveau, la localisation, la disponibilité et les préférences.\n\nLa plateforme répond à une frustration courante dans la communauté du tennis : la difficulté de trouver des partenaires compatibles, surtout en voyage. Notre système de mise en relation intelligent analyse les critères des utilisateurs pour proposer les partenaires les plus compatibles, rendant le tennis accessible partout.\n\nFonctionnalités clés : mise en relation IA basée sur le niveau et la localisation, planification selon les disponibilités avec intégration calendrier, navigation des profils avec informations détaillées des joueurs, système de messagerie intégré pour la coordination, mode voyage pour trouver des partenaires en vacances, et recommandations personnalisées pour la progression du niveau. La liste d'attente a été lancée en juin 2025 avec des avantages exclusifs pour les premiers adoptants incluant l'accès bêta, un accès gratuit étendu et une influence sur le développement des fonctionnalités.",
    "image": "/images/projects/play-tennis-everywhere.png",
    "imageAlt": "Interface de Play Tennis Everywhere montrant la mise en relation de partenaires et les fonctionnalités de planification",
    "technologies": ["Next.js", "TypeScript", "Supabase", "Tailwind CSS", "Resend", "Algorithme de Matching IA"],
    "githubUrl": null,
    "liveUrl": "https://play-tennis-everywhere.com",
    "featured": true,
    "order": 1,
    "createdAt": "2025-06-01T00:00:00Z",
    "updatedAt": "2025-10-04T00:00:00Z"
  },
  {
    "id": "fall-corp",
    "title": "Fall Corp",
    "shortDescription": "Plateforme complète connectant les startups aux investisseurs et aidant les fondateurs à constituer des équipes via la mise en relation de talents.",
    "detailedDescription": "VentureNexus (initialement appelé Fall Corp) a été développé pendant un programme d'innovation d'échange à Shanghai en juin 2025. Ce projet a été construit en utilisant la méthodologie agile en équipe, abordant deux défis majeurs dans l'écosystème entrepreneurial : connecter les startups avec les investisseurs appropriés et aider les fondateurs à constituer des équipes complètes.\n\nLa plateforme sert trois types d'utilisateurs : les fondateurs cherchant à constituer des équipes et obtenir du financement, les professionnels (designers, développeurs, marketers) cherchant des opportunités dans les startups, et les investisseurs recherchant des deals qualifiés. Elle propose un algorithme de mise en relation avancé qui connecte les fondateurs avec les professionnels selon les compétences requises et les investisseurs avec les startups selon les critères d'investissement.\n\nFonctionnalités clés : profils détaillés de startup avec pitch decks et métriques, marketplace de talents avec filtrage par compétences, système de messagerie sécurisée et cryptée, catégorisation des projets par secteur et stade de développement, système de vérification et d'accréditation des investisseurs, capacités de partage de documents, et filtres de recherche complets pour tous les types d'utilisateurs. La plateforme utilise un algorithme de mise en relation sophistiqué pour suggérer des connexions optimales entre toutes les parties, créant un écosystème complet pour le succès des startups. Note : La version en ligne n'est plus fonctionnelle en raison des coûts de ressources.",
    "image": "/images/projects/fall-corp.png",
    "imageAlt": "Plateforme VentureNexus montrant la mise en relation de startups et la constitution d'équipes",
    "technologies": ["TypeScript", "Supabase", "Tailwind CSS", "Lovable Platform"],
    "githubUrl": "https://github.com/Amorizz/fall_corp/",
    "liveUrl": "https://fall-corp.lovable.app/",
    "featured": true,
    "order": 2,
    "createdAt": "2025-06-01T00:00:00Z",
    "updatedAt": "2025-06-30T00:00:00Z"
  },
  {
    "id": "pocket-imperium",
    "title": "Pocket Imperium",
    "shortDescription": "Implémentation Java du jeu de plateau stratégique de conquête spatiale avec interfaces GUI et console.",
    "detailedDescription": "Pocket Imperium est une adaptation numérique du jeu de plateau stratégique acclamé où 2 à 4 joueurs se disputent la domination galactique. Cette implémentation Java propose à la fois une interface graphique et un mode de jeu en console, rendant le jeu accessible à différents styles de jeu.\n\nLe jeu est un jeu spatial 4X rapide (eXplorer, eXpansion, eXploiter, eXterminer) où les joueurs choisissent simultanément des commandes pour déplacer leurs flottes, étendre leurs empires et développer leurs systèmes. La version numérique recrée fidèlement la profondeur stratégique du jeu de plateau original, incluant son mécanisme unique de sélection de commandes où les joueurs doivent anticiper les actions de leurs adversaires.\n\nFonctionnalités clés : support double interface (GUI et console), gameplay stratégique au tour par tour avec sélection simultanée de commandes, système de déplacement de flotte et de combat, mécaniques d'expansion et de contrôle de territoire, suivi des points de victoire, et support multijoueur pour 2 à 4 joueurs. Le jeu met l'accent sur la prise de décision rapide et la planification stratégique, avec des parties durant généralement 30 à 45 minutes. Entièrement construit en Java, il démontre les principes de programmation orientée objet, la gestion d'état de jeu et la conception d'interface utilisateur.",
    "image": "/images/projects/pocket-imperium.png",
    "imageAlt": "Interface du jeu Pocket Imperium montrant le gameplay de conquête spatiale",
    "technologies": ["Java", "Swing/AWT", "Console I/O", "Conception Orientée Objet"],
    "githubUrl": "https://github.com/Amorizz/pocket-imperium/",
    "liveUrl": null,
    "featured": false,
    "order": 3,
    "createdAt": "2024-04-01T00:00:00Z",
    "updatedAt": "2024-06-30T00:00:00Z"
  },
  {
    "id": "portfolio-website",
    "title": "Site Portfolio",
    "shortDescription": "Template de portfolio moderne et open-source construit avec Next.js, proposant animations fluides, thème sombre et performances optimisées.",
    "detailedDescription": "Ce site portfolio sert à la fois de vitrine personnelle et de template open-source pour les autres. Construit avec Next.js 15, TypeScript et technologies web modernes, il démontre les meilleures pratiques actuelles en développement web avec un focus sur la performance, l'accessibilité et l'expérience utilisateur.\n\nLe site propose un thème sombre sophistiqué avec des animations fluides propulsées par CSS et JavaScript modernes. Il est conçu pour être facilement personnalisable, permettant aux autres de forker le dépôt et de l'adapter à leur usage personnel. Le projet met en valeur les fonctionnalités avancées de Next.js incluant l'App Router, les Server Components et l'optimisation d'images intégrée.\n\nFonctionnalités clés : design entièrement responsive optimisé pour tous les appareils, thème sombre élégant avec palette de couleurs soigneusement choisie, animations et transitions de défilement fluides, vitrine de projets avec descriptions détaillées, optimisation SEO avec meta tags appropriés et données structurées, optimisation des performances avec les meilleures pratiques Next.js, conformité d'accessibilité suivant les directives WCAG, et composants UI modernes utilisant shadcn/ui. La base de code est bien documentée et structurée pour servir de ressource d'apprentissage pour les autres développeurs. Disponible en open-source pour que quiconque puisse l'utiliser et le personnaliser pour son propre portfolio.",
    "image": "/images/projects/portfolio-website.png",
    "imageAlt": "Site portfolio moderne présentant des projets avec un design à thème sombre",
    "technologies": ["Next.js", "TypeScript", "Tailwind CSS", "shadcn/ui", "Vercel"],
    "githubUrl": "https://github.com/Amorizz/portfolio",
    "liveUrl": "https://amaury-dufrenot.com",
    "featured": true,
    "order": 4,
    "createdAt": "2025-10-01T00:00:00Z",
    "updatedAt": "2025-10-04T00:00:00Z"
  }
]
